---
type: AnalyticalPanel
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# AnalyticalPanel

`Autodesk.Revit.DB.Structure.AnalyticalPanel` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetAnalyticalOpeningsIds | 2023 | `public ISet < ElementId > GetAnalyticalOpeningsIds ()` |
| Property | Parameter | — | `` |
| Property | Thickness | 2023 | `public double Thickness { get ; set ; }` |